In [13]:
import pandas as pd
import numpy as np

In [14]:
df = pd.read_csv('../Machine_Learning/data/2020년_노인실태조사_ver2.0(최종공개용).csv')
# df = df[['RES_SEX','E1_1','RES_EDU1','B1','H16_2']] # 성별 직업지위  교육수준 건강수준  소득수준
df.head()

,PID,HNO,AREA,EDM,ANS_TYPE,ANS_SUB1,ANS_SUB2,ANS_SUB3,S9_0,S9_2,...,RES_YY,RES_MM,RES_AGE,RES_MAR,RES_EDU1,RES_EDU2,RES_YN,RES_SUB,f_wgt1,s_wgt1
0,7501,1,35,2,0,99,999,1,0,99,...,1952,10,67,1,4,9,1,9,393.325736,0.512734
1,7601,1,35,2,0,99,999,1,0,99,...,1951,12,68,3,2,0,1,9,393.325736,0.512734
2,7802,2,23,1,0,99,999,1,1,1,...,1954,3,66,2,5,12,1,9,587.163656,0.765418
3,7801,1,23,1,0,99,999,1,0,99,...,1954,1,66,2,5,12,1,9,640.643430,0.835133
4,8001,1,35,1,0,99,999,1,0,99,...,1951,12,68,3,3,6,1,9,493.769927,0.643671

In [15]:
df['Gender'] = np.where(df['RES_SEX'] == 1, '남자','여자')

In [16]:
df['Job'] = np.where(df['E1_1'].isin([11,12,13,14,15,21,22,23,24,25,26,27,28]),'임금_고숙련',
                     np.where(df['E1_1'].isin([31,32,33,39,61,62,63,72,73,74,75,76,77,78,79,81,82,83,84,85,86,87,88,89,100]),'임금_중숙련',
                              np.where(df['E1_1'].isin([41,42,43,44,51,52,53,91,92,93,94,95,99]),'임금_저숙련',
                                       np.where(df['E1_3'].isin([3,4]),'자영업',
                                                np.where(df['E1_3']==6 ,'무급가족종사자',
                                                         np.where(df['E1']==2, '은퇴',
                                                                  np.where(df['E1_1']==999,'비경활',np.nan)))))))

In [17]:
df['Edu'] = np.where(df['RES_EDU1'] >= 6 , '대학교 이상',
                    np.where(df['RES_EDU1']== 5, '고등',
                              np.where(df['RES_EDU1']== 4, '중등','초등'
                    )))

In [18]:
df['Health'] = np.where(df['B1'].isin([1,2,9]), '전혀 지장 없음',
                        np.where(df['B1'].isin([4,5]),'활동에 제한 있음', '그렇지 않은 편'
                        ))

In [19]:
df['Earn'] = pd.qcut(df['J3b_3_13'], 3, labels=['하', '중', '상'])

In [20]:
df = df[['Gender','Job','Edu','Health','Earn']]

In [21]:
df.head()

  Gender     Job Edu    Health Earn
0     여자  임금_저숙련  중등  전혀 지장 없음    중
1     여자  임금_중숙련  초등  전혀 지장 없음    중
2     여자  임금_고숙련  고등  전혀 지장 없음    상
3     남자  임금_중숙련  고등  전혀 지장 없음    상
4     여자  임금_저숙련  초등  그렇지 않은 편    하

In [22]:
df.isna().sum()

Gender    0
Job       0
Edu       0
Health    0
Earn      0
dtype: int64

In [23]:
df.to_csv('./data/노인실태조사_전처리.csv', encoding='utf-8', index=False)